//------------------------------------------------------Задача 25-----------------------------------------------------------//

//Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B. (Задачи, решенные через Math.Pow, будут отправлены на переделку, так как задача стоит в том, чтобы написать цикл)

//3, 5 -> 243 (3⁵)

//2, 4 -> 16

/*
Console.WriteLine("Введите два числа");
int numA = Convert.ToInt32(Console.ReadLine());
int numB = Convert.ToInt32(Console.ReadLine());
Pow(numA, numB);

//---------------------------------------Методы---------------------------------------//

void Pow(int numberA, int numberB)
{
    int temp = numberA;
    for (int i = 0; i < numberB; i++)
    {
        numberA = numberA * temp;
    }
    Console.WriteLine(numberA/temp);
}
*/



//------------------------------------------------------Задача 27-----------------------------------------------------------//

//Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

//452 -> 11

//82 -> 10

//9012 -> 12


/*Console.WriteLine("Введите число");
int num = Convert.ToInt32(Console.ReadLine());
int length = NumLen(num);
Console.WriteLine(SumNumbers(num, length));


//----------------------------------------------------Методы-------------------------------------------------------//

int NumLen(int num)
{
    if (num < 0)
    {
        num = -num;
    }
    int length = 0;
    while (num > 0)
    {
        num = num / 10;
        length++;
    }
    return length;
}

int SumNumbers(int num, int length)
{
    int sum = 0;
    for (int i = 1; i <= length; i++)
    {
        sum = sum + num % 10;
        num = num / 10;
    }
    if (sum < 0)
    {
        sum = -sum;
    }
    return sum;
}
*/



//------------------------------------------------------Задача 29-----------------------------------------------------------//

//Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. (числа берете любые)

/*Console.WriteLine("Введите длину массива"); 
int size = int.Parse(Console.ReadLine());
PrintArray(size);

//--------------------------------------------------Методы---------------------------------------------------------//
void PrintArray(int size) //универсальный метод. при заданной длине выводит на экран заданное кол-во элементов
{
    int[] array = new int[size];
    for (int i = 0; i < size; i++)
    {
        array[i] = new Random().Next(5, 12); //диапазон чисел, которые будут представлены в массиве
        Console.Write(array[i] + " ");
    }
}
*/